{
  "displayName": "CA001-AllUsers-RequireMFA-AllPlatforms",
  "state": "enabled",
  "conditions": {
    "users": {
      "includeUsers": ["All"],
      "excludeGroups": ["{{GROUP_ID_grp-ca-breakglass-exclude}}"]
    },
    "applications": { "includeApplications": ["All"] },
    "clientAppTypes": ["browser", "mobileAppsAndDesktopClients"]
  },
  "grantControls": {
    "operator": "OR",
    "builtInControls": ["mfa"]
  },
  "_metadata": {
    "pack": "conditional-access-baseline",
    "nist": ["IA-2", "IA-2(2)"],
    "cis": ["1.1.1"],
    "cmmc": ["IA.L2-3.5.3"],
    "notes": "Replace {{GROUP_ID_grp-ca-breakglass-exclude}} with your break-glass exclusion group object ID."
  }
}
