{
  "displayName": "CA009-AllUsers-AppProtection-Mobile",
  "state": "enabled",
  "conditions": {
    "users": {
      "includeUsers": ["All"],
      "excludeGroups": ["{{GROUP_ID_grp-ca-breakglass-exclude}}"]
    },
    "applications": { "includeApplications": ["All"] },
    "clientAppTypes": ["browser", "mobileAppsAndDesktopClients"],
    "platforms": { "includePlatforms": ["iOS", "android"] }
  },
  "grantControls": {
    "operator": "OR",
    "builtInControls": ["compliantApplication"]
  },
  "_metadata": {
    "nist": ["AC-17"],
    "notes": "Requires Intune app protection policy on iOS and Android."
  }
}
