{
  "displayName": "CA008-AllUsers-BlockRestrictedCountries-AllPlatforms",
  "state": "enabled",
  "conditions": {
    "users": {
      "includeUsers": ["All"],
      "excludeGroups": ["{{GROUP_ID_grp-ca-breakglass-exclude}}"]
    },
    "applications": { "includeApplications": ["All"] },
    "clientAppTypes": ["browser", "mobileAppsAndDesktopClients"],
    "locations": {
      "includeLocations": ["{{NAMED_LOCATION_ID_Blocked_Countries}}"]
    }
  },
  "grantControls": {
    "operator": "OR",
    "builtInControls": ["block"]
  },
  "_metadata": {
    "nist": ["IA-8"],
    "notes": "Blocks access from named location Blocked Countries (RU, CN, KP, IR)."
  }
}
