{
  "displayName": "CA004-AllUsers-BlockHighRiskSignIn-AllPlatforms",
  "state": "enabled",
  "conditions": {
    "users": {
      "includeUsers": ["All"],
      "excludeGroups": ["{{GROUP_ID_grp-ca-breakglass-exclude}}"]
    },
    "applications": { "includeApplications": ["All"] },
    "clientAppTypes": ["browser", "mobileAppsAndDesktopClients"],
    "signInRiskLevels": ["high"]
  },
  "grantControls": {
    "operator": "OR",
    "builtInControls": ["block"]
  },
  "_metadata": {
    "nist": ["AC-7"],
    "notes": "Requires Entra ID P2. Blocks sign-ins flagged as high risk."
  }
}
