{
  "displayName": "CA010-Admins-PhishingResistantMFA-AllPlatforms",
  "state": "enabled",
  "conditions": {
    "users": {
      "includeRoles": [
        "62e90394-69f5-4237-9190-012177145e10",
        "194ae4cb-b126-40b2-bd5b-6091b380977d",
        "29232cdf-9323-42fd-ade2-1d097af3e4de",
        "f28a1f50-f6e7-4571-818b-6a12f2af6b6c"
      ],
      "excludeGroups": ["{{GROUP_ID_grp-ca-breakglass-exclude}}"]
    },
    "applications": { "includeApplications": ["All"] },
    "clientAppTypes": ["browser", "mobileAppsAndDesktopClients"]
  },
  "grantControls": {
    "operator": "OR",
    "authenticationStrength": {
      "id": "00000000-0000-0000-0000-000000000004",
      "displayName": "Phishing-resistant MFA"
    }
  },
  "_metadata": {
    "nist": ["IA-2(1)", "IA-5"],
    "cis": ["1.1.3"],
    "cmmc": ["IA.L2-3.5.3"],
    "notes": "Requires FIDO2 or Windows Hello for Business. Standard MFA not sufficient."
  }
}
